[
    {
        "content" : "Tous les hommes pensent que le bonheur se trouve au sommet de la montagne alors qu'il réside dans la façon de la gravir",
        "author" : "Confucius"
    },
    {
        "content" : "Le bonheur est souvent la seule chose qu’on puisse donner sans l’avoir et c’est en le donnant qu’on l’acquiert",
        "author" : "Voltaire"
    },
    {
        "content" : "Tous les hommes font la même erreur, de s'imaginer que bonheur veut dire que tous les vœux se réalisent",
        "author" : "Léon Tolstoï"
    },
    {
        "content" : "Le bonheur pour une abeille ou un dauphin est d'exister, pour l'homme, de le savoir et de s'en émerveiller",
        "author" : "Jacques-Yves Cousteau"
    },
    {
        "content" : "Être un homme, c'est sentir, en posant sa pierre, que l'on contribue à bâtir le monde.",
        "author" : "Antoine de Saint-Exupéry"
    },
    {
        "content" : "Nous réalisons que ce que nous accomplissons n'est qu'une goutte dans l'océan. Mais si cette goutte n’existait pas dans l'océan, elle manquerait.",
        "author" : "Mère teresa"
    },
    {
        "content" : "La confiance est le ciment invisible qui conduit une équipe à gagner.",
        "author" : "Bud Wilkinson"
    },
    {
        "content" : "Ce n’est pas à nos gouvernements de nous dire comment être solidaires. C’est à nous de leur montrer la société que nous voulons. Ils comprendront.",
        "author" : "Abbé Pierre"
    },
    {
        "content" : "Il faut faire de sa vie un chef d'œuvre.",
        "author" : "Goethe"
    },
    {
        "content" : "L'important n'est pas d'avoir beaucoup d'année dans sa vie, mais de mettre beaucoup de vie dans ses années.",
        "author" : "J.F.Kennedy"
    },
    {
        "content" : "Apprendre d’hier, vivre pour aujourd’hui, espérer pour demain.",
        "author" : "Albert Einstein"
    },
    {
        "content" : "Les gagnants trouvent des moyens, les perdants des excuses.",
        "author" : "Franklin Roosevelt"
    },
    {
        "content" : "Quand je suis allé à l'école, ils m'ont demandé ce que je voulais être quand je serai grand. J'ai répondu : 'Heureux'. Ils m’ont dit que je n’avais pas compris la question, j’ai répondu qu’ils n’avaient pas compris la vie.",
        "author" : "John Lennon"
    },
    {
        "content" : "Nous devenons pareil à l'idéal que nous portons en nous.",
        "author" : "Dale Carnegie"
    }
]
