{
  "post": [
    {
      "id": 1,
      "title": "Définir le langage naturel",
      "slug": "definir-le-langage-naturel",
      "body": "Si une page ne contient pas de définition explicite du langage naturel dans lequel elle est rédigée, les logiciels risquent de ne pas pouvoir traduire correctement le contenu. Le terme &laquo;&nbsp;langue naturelle&nbsp;&raquo; fait référence à la langue utilisée pour le contenu de la page, et non au langage de programmation. Ce manque d'information peut entraîner des traductions erronées, une mauvaise mise en forme et un contenu difficile à comprendre pour les utilisateurs de lecteurs d'écran.\r\n\r\nVous pouvez définir la langue naturelle d'une page en utilisant l'attribut `lang` sur l'élément `<html>`.\r\n**<span id=\"exemple-1\">Exemple&nbsp;1</span>&nbsp;&ndash;&nbsp;Le français défini comme la langue naturelle de la page**\r\n\r\n```html\r\n<!DOCTYPE html>\r\n<html lang=\"fr\">\r\n</html>\r\n```\r\n\r\nVous pouvez également définir un dialecte spécifique de la langue de base.\r\n<br>**<span id=\"exemple-2\">Exemple&nbsp;2</span>&nbsp;&ndash;&nbsp;Le français de France défini comme la langue naturelle de la page**\r\n\r\n```html\r\n<!DOCTYPE html>\r\n<html lang=\"fr-FR\">\r\n</html>\r\n```\r\n\r\nL'attribut lang est global, ce qui signifie que vous pouvez l'utiliser sur n'importe quel élément, bien qu'il puisse ne pas affecter certains d'entre eux. Il peut être utile si une page est rédigée dans une langue mais contient des passages de texte ou même des mots isolés dans d'autres langues.\r\n\r\n**<span id=\"exemple-3\">Exemple&nbsp;3</span>&nbsp;&ndash;&nbsp;Japonais translittéré en écriture latine utilisé sur une page écrite en français.**\r\n\r\n```html\r\n<!DOCTYPE html>\r\n<html lang=\"fr\">\r\n    <head></head>\r\n    <body>\r\n        <p>The Wind-Up Bird Chronicle (<span lang=\"ja-Latn\">Nejimakidori Kuronikuru </span>) is a novel published in 1994 by Japanese author Haruki Murakami.</p>\r\n    </body>\r\n</html>\r\n```\r\n\r\nUtilisez la pseudoclasse `:lang()` pour ajuster la typographie et la mise en page pour des langues spécifiques.\r\n\r\n**<span id=\"exemple-4\">Exemple&nbsp;4</span>&nbsp;&ndash;&nbsp;Sélection de tous les éléments en langue serbe**\r\n\r\n```css\r\n:lang(sr) {\r\n    font-family: 'Cyrillic font', sans-serif;\r\n}\r\n```\r\n\r\nLes technologies d'assistance et autres logiciels peuvent ne pas être en mesure de déterminer automatiquement la langue naturelle d'une page. Certaines fonctions du HTML et des feuilles de style en cascade (CSS) s'appuient sur ces informations pour aider à localiser le contenu et offrir une excellente expérience utilisateur.\r\n\r\nVous devez définir la langue de chaque page de manière programmatique et explicite en utilisant l'attribut lang sur l'élément `<html>`, comme le montre [l'exemple 1](#exemple-1). Pour les passages de texte écrits dans une langue différente de la langue principale de la page, vous pouvez également utiliser l'attribut, comme le montre [l'exemple 3](#exemple-3). Cela permet aux lecteurs d'écran d'améliorer la prononciation en modifiant les profils vocaux en fonction de certains mots ou phrases.\r\n\r\nUtilisez cette fonctionnalité avec parcimonie car le changement de profil vocal peut être gênant en interrompant le flux de lecture. Pour les mots étrangers bien établis, ce n'est pas forcément nécessaire. Des exemples en allemand sont des mots anglais comme &laquo;&nbsp;Download&nbsp;&raquo;, &laquo;&nbsp;Workshop&nbsp;&raquo; ou &laquo;&nbsp;Link&nbsp;&raquo;.\r\n\r\nLa valeur de l'attribut `lang` doit être une <a href=\"https://datatracker.ietf.org/doc/html/rfc5646\" target=\"_blank\">balise de langue BCP 47</a> valide, composée d'une ou plusieurs balises secondaires. Un *subtag* est une séquence de caractères alphanumériques distingués et séparés des autres subtags par un trait d'union.\r\n\r\nLa *sous-étiquette* de langue est un code de 2 ou 3 caractères qui définit la langue principale : par exemple, `en` pour l'anglais, `de` pour l'allemand ou `fr` pour le français, comme le montre [l'exemple 5](#exemple-5).\r\n\r\n**<span id=\"exemple-5\">Exemple 5</span>&nbsp;&ndash;&nbsp;L'espagnol défini comme la langue naturelle de la page**\r\n\r\n```html\r\n<html lang=\"es\"></html>\r\n```\r\n\r\n## Sous-étiquettes d'écriture\r\nLa sous-étiquette d'écriture facultative est un code de 4 caractères qui définit le système d'écriture utilisé pour la langue, comme le montre [l'exemple 6](#exemple-6).\r\n\r\n**<span id=\"exemple-6\">Exemple 6</span>&nbsp;&ndash;&nbsp;Un nom en écriture cyrillique à côté du même nom en écriture latine marqué comme tel**\r\n\r\n```html\r\nНикола Јокић (<span lang=\"sr-Latn\">Nikola Jokić</span>).\r\n```\r\n\r\nLa *sous-étiquette* facultative de région est généralement un code de pays à 2 caractères écrit en majuscules et définit un dialecte de la langue de base, comme le montre [l'exemple 7](#exemple-7).\r\n\r\n**<span id=\"exemple-7\">Exemple 7</span>&nbsp;&ndash;&nbsp;L'allemand autrichien défini comme la langue naturelle de la page**\r\n\r\n```html\r\n<!DOCTYPE html>\r\n<html lang=\"de-AT\">\r\n</html>\r\n```\r\nVous devez utiliser le code de langue primaire à deux caractères et n'ajouter des balises secondaires de région que lorsqu'il est nécessaire de différencier le contenu dans différents dialectes qui peuvent ne pas être mutuellement compréhensibles. Pour les utilisateurs de lecteurs d'écran, le fait de ne pas ajouter de sous-tags de région ne devrait pas faire de différence car ils sont généralement ignorés par le logiciel.\r\n\r\nVous pouvez trouver une liste de toutes les étiquettes et sous-étiquettes dans la <a href=\"https://r12a.github.io/app-subtags/\" target=\"_blank\">liste des sous-étiquettes de la langue BCP 47</a>.\r\n\r\n## Les avantages\r\nL'attribut `lang` est puissant et affecte de nombreux aspects de l'accessibilité du web et de l'expérience utilisateur en général. Voici ses principaux avantages :\r\n\r\n### La technologie d'assistance\r\nLes synthétiseurs vocaux qui prennent en charge plusieurs langues adaptent leur prononciation et leur syntaxe à la langue de la page, prononçant le texte avec l'accent et la prononciation appropriés.\r\n\r\nPour une page au contenu allemand dont la langue est réglée sur l'anglais (`lang=\"en\"`), le logiciel de lecture d'écran peut choisir un profil de voix synthétique anglais et lire le texte allemand avec une prononciation anglaise. Si vous ne définissez aucune langue, les lecteurs d'écran risquent de se rabattre sur les paramètres par défaut du système de l'utilisateur, ce qui peut ne pas être approprié. Le résultat peut être difficile à comprendre, confus ou même complètement erroné.\r\n\r\nTous les lecteurs d'écran ne prennent pas en charge de nombreuses langues. Certains logiciels changent de langue automatiquement, tandis que pour d'autres, les utilisateurs doivent installer et configurer manuellement des voix ou des packs de langues.\r\n\r\nLa définition de l'attribut permet également au logiciel de traduction en braille d'optimiser la sortie et de l'empêcher de créer par erreur des <a href=\"https://www.rnib.org.uk/living-with-sight-loss/education-and-learning/braille-tactile-codes/contracted-grade-2-braille-explained/\" target=\"_blank\">contractions en braille de grade 2</a>.\r\n\r\n### La traduction\r\nLes outils de traduction comme Google Translate utilisent les informations de l'attribut `lang` pour traduire le contenu de la page. Bien que ce type de logiciel soit généralement bon pour détecter automatiquement la langue de la page, un décalage entre la langue réelle et la langue définie peut donner lieu à des <a href=\"https://www.matuzo.at/blog/lang-attribute/\" target=\"_blank\">traductions inattendues et non souhaitées</a>.\r\n\r\n### Les citations\r\nLes guillemets peuvent changer en fonction de la langue naturelle de la page. Par exemple, l'anglais utilise des guillemets différents de ceux de l'allemand ou du français, et la bonne définition de lang aide les navigateurs à choisir les glyphes appropriés, comme l'illustrent les exemples [8](#exemple-8), [9](#exemple-9) et [10](#exemple-10).\r\n\r\n**<span id=\"exemple-8\">Exemple&nbsp;8</span>&nbsp;&ndash;&nbsp;Guillemets automatiques à l'aide de l'élément `<q>` en anglais**\r\n\r\n```html\r\n<p lang=\"en\">\r\n    <q>A quote in English.</q>\r\n</p>\r\n<!-- Résultat : \"A quote in English.\" -->\r\n```\r\n**<span id=\"exemple-9\">Exemple&nbsp;9</span>&nbsp;&ndash;&nbsp;Guillemets automatiques à l'aide de l'élément `<q>` en allemand**\r\n\r\n```html\r\n<p lang=\"de\">\r\n<q>Ein Zitat auf Deutsch.</q>\r\n</p>\r\n<!-- Résultat : „Ein Zitat auf Deutsch.\" -->\r\n```\r\n**<span id=\"exemple-10\">Exemple&nbsp;10</span>&nbsp;&ndash;&nbsp;Guillemets automatiques utilisant l'élément `<q>` en français**\r\n\r\n```html\r\n<p lang=\"fr\">\r\n<q>Une citation en français.</q>\r\n</p>\r\n<!-- Résultat : « Une citation en français. » -->\r\n```\r\n### La césure\r\nL'attribut `lang` peut affecter <a href=\"https://developer.mozilla.org/fr/docs/Web/CSS/hyphens\" target=\"_blank\">la césure</a> dans les CSS. Voir l'[exemple&nbsp;11](#exemple-11).\r\n\r\n**<span id=\"exemple-11\">Exemple&nbsp;11</span>&nbsp;&ndash;&nbsp;Un paragraphe avec une largeur maximale de 28 caractères et une césure activée**\r\n\r\n```css\r\np {\r\n    max-width: 28ch;\r\n    hyphens: auto;\r\n}\r\n```\r\nDans les exemples&nbsp;[12](#exemple-12), [13](#exemple-13) et [14](#exemple-14), vous pouvez voir comment le même paragraphe écrit en allemand, avec une valeur d'attribut lang différente, est rendu différemment dans Google Chrome. Les mots ne s'interrompent pas du tout ou s'interrompent à des positions différentes. Seuls le premier et le deuxième exemples sont corrects. Il convient de noter que les navigateurs se comportent différemment.\r\n\r\n**<span id=\"exemple-12\">Exemple&nbsp;12</span>&nbsp;&ndash;&nbsp;Texte allemand correctement coupé par un trait d'union dans un paragraphe défini comme allemand**\r\n\r\n```html\r\n<p lang=\"de\">\r\nWeit hinten, hinter den Wortbergen, fern der Länder Vokalien und Konsonantien\r\nleben die Blindtexte. Abgeschieden wohnen sie in Buchstabhausen an der Küste\r\ndes Semantik, eines großen Sprachozeans. Ein kleines Bächlein namens Duden\r\nfließt durch ihren Ort und versorgt sie mit den nötigen Regelialien.\r\n</p>\r\n<!-- Résultat :\r\nWeit hinten, hinter den Wortbergen,\r\n     fern der Länder Vokalien und Konso-\r\n     nantien leben die Blindtexte. Abge-\r\n     schieden wohnen sie in Buchstab-\r\n     hausen an der Küste des Semantik,\r\n     eines großen Sprachozeans.\r\n     -->\r\n```\r\n**<span id=\"exemple-13\">Exemple&nbsp;13</span>&nbsp;&ndash;&nbsp;Pas de césure du texte allemand dans un paragraphe défini comme anglais**\r\n\r\n```html\r\n     <p lang=\"en\">\r\n     Weit hinten,…\r\n     </p>\r\n     <!-- Résultat :\r\n     Weit hinten, hinter den Wortbergen,\r\n     fern der Länder Vokalien und\r\n     Konsonantien leben die Blindtexte.\r\n     Abgeschieden wohnen sie in\r\n     Buchstabhausen an der Küste des\r\n     Semantik, eines großen\r\n     Sprachozeans.\r\n     -->\r\n```\r\n**<span id=\"exemple-14\">Exemple&nbsp;14</span>&nbsp;&ndash;&nbsp;Trait d'union incorrect du texte allemand dans un paragraphe défini comme français**\r\n\r\n```html\r\n     <p lang=\"fr\">\r\n     Weit hinten,…\r\n     </p>\r\n     <!-- Résultat :\r\n     Weit hinten, hinter den Wortbergen,\r\n     fern der Länder Vokalien und Konso-\r\n     nantien leben die Blindtexte. Abges-\r\n     chieden wohnen sie in Buchstabhau-\r\n     sen an der Küste des Semantik, eines\r\n     großen Sprachozeans.\r\n     -->\r\n```\r\n### Sélection des polices\r\n\r\nLes navigateurs peuvent sélectionner <a href=\"https://www.w3.org/International/questions/qa-lang-why#fonts\" target=\"_blank\">des polices adaptées</a> à la langue pour afficher les détails des caractères idéographiques qui varient d'une langue à l'autre, tels que le chinois, le japonais et le coréen (connus sous le nom de \"langues CJK\").\r\n\r\n### Optimisation des moteurs de recherche (SEO)\r\n\r\nUne bonne définition du langage naturel peut améliorer la qualité des résultats de recherche en aidant les moteurs de recherche à la localisation.\r\n\r\n### Contrôles de formulaires\r\n\r\nDans certains navigateurs, l'attribut `lang` affecte également la mise en forme des contrôles de formulaire. Par exemple, <a href=\"https://www.mozilla.org/fr/firefox/new/\" target=\"_blank\">Firefox</a> affiche les bons caractères décimaux dans les champs de saisie des nombres en fonction de la langue.\r\n",
      "created": "2025-05-29T12:47:21.648027",
      "updated": "2025-05-29T12:47:21.648038",
      "status_id": 1
    },
    {
      "id": 2,
      "title": "OWASP Top 10 (Édition 2021) : Comment Django contribue à sécuriser vos applications web ?",
      "slug": "owasp-top-10-edition-2021-comment-django-contribue-a-securiser-vos-applications-web",
      "body": "L’**OWASP** (*Open Web Application Security Project*) est une organisation à but non lucratif qui œuvre pour améliorer la sécurité des applications web. Son célèbre classement **OWASP Top 10**, mis à jour en 2021, identifie les vulnérabilités les plus critiques affectant les applications modernes, sur la base d’analyses portant sur plus de 500 000 applications web.\r\n\r\nDans cet article, nous nous intéresserons à la manière dont **Django**, le framework web Python, permet de mitiger ces menaces par ses mécanismes intégrés et sa philosophie de développement sécurisé.\r\n\r\n## Défaillances du contrôle d’accès\r\nLes défaillances du contrôle d’accès représentent l'une des vulnérabilités les plus critiques identifiées par l’OWASP. Elles se produisent lorsque des utilisateurs peuvent accéder à des ressources ou effectuer des actions qui devraient leur être interdites — qu’il s’agisse de consulter des données sensibles, de modifier le profil d’un autre utilisateur, ou d’accéder à des fonctionnalités réservées aux administrateurs.\r\n\r\n### Comment Django se positionne-t-il face à cette menace ?\r\n**Django propose plusieurs mécanismes robustes pour mettre en œuvre un contrôle d’accès efficace :**\r\n\r\n- **Les mixins `LoginRequiredMixin` et `PermissionRequiredMixin`** permettent de restreindre facilement l’accès aux vues basées sur les classes, en imposant l’authentification ou des permissions spécifiques.\r\n- **Le système de permissions intégré** offre une granularité fine : chaque modèle peut être associé à des permissions de lecture, d’écriture ou de suppression. Il est également possible de définir des permissions personnalisées selon les besoins métier.\r\n- **Les décorateurs `@login_required` et `@permission_required`** peuvent être utilisés sur les vues fonctionnelles pour un contrôle simple et explicite.\r\n- **Les objets `request.user` et `request.user.has_perm()`** permettent de vérifier dynamiquement, côté serveur, si l’utilisateur dispose bien des autorisations nécessaires pour une action donnée.\r\n- **La gestion des groupes (`Group`)** permet de centraliser les permissions pour plusieurs utilisateurs, ce qui est particulièrement utile dans des applications complexes.\r\n\r\nDjango ne se contente pas de proposer des outils techniques : il incite à adopter une discipline de conception respectant le principe de moindre privilège. En combinant ses outils natifs avec une réflexion rigoureuse sur les droits des utilisateurs, le framework permet de prévenir efficacement la plupart des défaillances de contrôle d’accès.\r\n\r\n## Défaillances cryptographiques\r\nLes défaillances cryptographiques surviennent lorsqu’un système repose sur des mécanismes de chiffrement ou de hachage obsolètes, mal configurés ou insuffisamment robustes. Ces erreurs exposent les données sensibles – telles que les mots de passe, les jetons d’authentification ou les informations personnelles – à des risques de compromission, de falsification ou d’interception.\r\n\r\n### Comment Django protège-t-il les données sensibles ?\r\n**Django intègre par défaut des pratiques cryptographiques solides, notamment :**\r\n\r\n- **Un mécanisme de hachage robuste pour les mots de passe**, utilisant des algorithmes éprouvés comme **PBKDF2, Bcrypt, et Argon2**. Ces méthodes sont conçues pour résister aux attaques par force brute et rendent extrêmement coûteuse la récupération d’un mot de passe en clair à partir d’un hash.\r\n- **Une gestion centralisée et sécurisée des secrets via le paramètre** `SECRET_KEY`, utilisé notamment pour signer les cookies, les jetons CSRF, ou encore les sessions utilisateur. Il est essentiel pour assurer l’intégrité et la confidentialité des échanges entre le client et le serveur.\r\n\r\n**Attention** : il est impératif de **ne jamais exposer** la variable `SECRET_KEY` dans votre code source ou dans un dépôt public. Pour renforcer la sécurité, stockez-la dans des variables d’environnement ou un coffre-fort numérique adapté (comme HashiCorp Vault, AWS Secrets Manager, etc.).\r\n\r\nEn fournissant une base cryptographique fiable et des recommandations claires, Django permet de réduire considérablement les risques liés à une mauvaise implémentation de la sécurité des données. Toutefois, la vigilance du développeur reste de mise : le choix des bons algorithmes et la gestion rigoureuse des secrets sont des responsabilités à ne pas négliger.\r\n\r\n## Injections\r\nLes failles d’injection comptent parmi les vulnérabilités les plus critiques et les plus courantes dans les applications web. Elles permettent à un attaquant d’introduire des données malveillantes dans une requête — souvent SQL ou HTML — afin d’altérer le comportement attendu de l’application. Ces attaques peuvent entraîner des accès non autorisés à la base de données, des fuites de données sensibles, voire une compromission totale du système.\r\n\r\n### Comment Django prévient-il les risques d’injection ?\r\n**Django fournit des mécanismes robustes pour prévenir les attaques d’injection, notamment :**\r\n\r\n- **Un ORM (Object-Relational Mapper) sécurisé**, qui repose sur des **requêtes paramétrées.** En encapsulant automatiquement les valeurs des paramètres, Django empêche l’exécution de code arbitraire via les champs utilisateur. Cela protège efficacement contre les attaques par injection SQL.\r\n- **Un système de templates sécurisé** qui applique **l’échappement automatique** des variables injectées dans le HTML. Par défaut, toute donnée affichée dans une vue Django est considérée comme potentiellement dangereuse et est donc échappée pour éviter les attaques XSS (Cross-Site Scripting).\r\n\r\n**Attention** : lorsque vous utilisez des requêtes brutes comme `raw()` ou `extra()`, vous contournez les protections de l’ORM. Dans ce cas, **vous êtes responsable** de la sécurisation des données injectées. Une vigilance accrue s’impose.\r\n\r\nGrâce à ces mécanismes, Django limite fortement les vecteurs d’injection. Toutefois, la sécurité repose aussi sur les bonnes pratiques du développeur : valider et nettoyer les entrées utilisateur, éviter l’exécution de code dynamique, et restreindre les permissions en base de données restent des mesures essentielles.\r\n\r\n## Conception non sécurisée\r\n\r\nLa conception non sécurisée désigne l’absence de mécanismes de sécurité dès les premières phases de développement d’une application. Elle ne relève pas d’un simple oubli de configuration, mais d’un manque de réflexion globale sur la sécurité : modèles de menace inexistants, absence de mesures défensives durables, ou encore méconnaissance des vecteurs d’attaque.\r\n\r\nIl ne s’agit pas ici d’un défaut d’implémentation, mais bien d’un défaut de conception. Une telle lacune rend l’application vulnérable à un large éventail d’attaques, souvent impossibles à corriger sans une refonte partielle du système.\r\n\r\n### Django encourage une approche sécurisée par défaut :\r\n**Le framework Django intègre nativement des pratiques de sécurité qui incitent à une architecture résiliente :**\r\n\r\n- **La philosophie \"secure by default\"** : de nombreux composants sont conçus pour restreindre les comportements dangereux. Par exemple, les protections CSRF (Cross-Site Request Forgery), l’échappement automatique dans les templates, ou la gestion rigoureuse des sessions sont activés par défaut.\r\n- **Une documentation abondante et claire** dédiée aux problématiques de sécurité, permettant aux développeurs d’intégrer de bonnes pratiques dès la phase de conception.\r\n- **Des options de configuration explicites** pour les paramètres critiques comme les en-têtes HTTP de sécurité (`SECURE_*`), les politiques de cookies, ou les mécanismes de hachage des mots de passe.\r\n\r\nEn résumé, si Django offre une base sécurisée, c’est au développeur d’adopter une posture proactive : intégrer la sécurité dès la phase de conception, penser en termes de scénarios d’attaque, et effectuer des revues régulières d’architecture sont des habitudes indispensables à la création de systèmes robustes.\r\n\r\n## Mauvaise configuration de sécurité\r\n\r\nUne mauvaise configuration de sécurité survient lorsque des paramètres critiques ne sont pas correctement définis, que des composants par défaut sont laissés activés en production, ou encore lorsque des services inutiles restent accessibles. Ces négligences exposent l’application à des vecteurs d’attaque souvent évitables.\r\n\r\nCe type de vulnérabilité est particulièrement courant : il peut découler de l’usage de configurations inadéquates en environnement de production, de l’oubli de désactiver les débogueurs, ou d’une méconnaissance des options de sécurité offertes par le framework.\r\n\r\n**Django fournit plusieurs garde-fous contre les erreurs de configuration :**\r\n- **Le paramètre `DEBUG`**, qui doit impérativement être désactivé en production. En effet, activé, il révèle des informations sensibles sur l’état interne de l’application, les erreurs et les variables de contexte.\r\n- **Les paramètres de sécurité HTTP** (`SECURE_*`), tels que :\r\n\t- `SECURE_SSL_REDIRECT` : redirige automatiquement tout le trafic HTTP vers HTTPS.\r\n\t- `SECURE_HSTS_SECONDS` : active la politique HSTS pour inciter les navigateurs à n’utiliser que des connexions sécurisées.\r\n\t- `SECURE_BROWSER_XSS_FILTER`, `SECURE_CONTENT_TYPE_NOSNIFF`, etc.\r\n- **Le contrôle des hôtes autorisés** (`ALLOWED_HOSTS`) : ce paramètre restreint les domaines autorisés à interagir avec l’application, évitant les attaques de type Host Header Injection.\r\n- **La gestion des erreurs** : en production, les pages d’erreur doivent être personnalisées afin de ne divulguer aucun détail technique.\r\n\r\n**Attention**: Une configuration négligée transforme une application bien conçue en cible facile. Il est vivement conseillé de revoir régulièrement les paramètres de déploiement, d’automatiser les vérifications via des tests d’intégration et de se référer aux recommandations officielles.\r\n\r\n\r\n## Composants vulnérables et obsolètes\r\n\r\nCette vulnérabilité résulte de l’utilisation de bibliothèques, dépendances ou modules dont des failles de sécurité ont été identifiées mais non corrigées. Elle est d’autant plus critique que ces composants sont souvent intégrés au cœur du fonctionnement de l’application.\r\n\r\nLes menaces peuvent provenir de :\r\n\r\n- bibliothèques open-source non maintenues,\r\n- dépendances non mises à jour,\r\n- composants tiers activés sans vérification de leur intégrité ni de leur provenance.\r\n\r\n**Django et l’écosystème Python offrent plusieurs leviers de prévention :**\r\n- **Le fichier** `requirements.txt` ou `pyproject.toml`, qui permet de verrouiller les versions des dépendances et d’en suivre l’évolution de manière contrôlée.\r\n- **Les outils d’audit automatique**, tels que :\r\n\t- `pip-audit` ou `safety`, pour analyser les dépendances à la recherche de vulnérabilités connues.\r\n\t- `dependabot` ou `renovate` (si vous utilisez GitHub ou GitLab), qui suggèrent des mises à jour dès qu’une faille est identifiée.\r\n- **La documentation Django** elle-même, régulièrement mise à jour pour corriger ou contourner des failles affectant ses versions antérieures. Il est donc crucial de suivre les notes de version et les bulletins de sécurité publiés par l’équipe Django.\r\n\r\nUn composant vulnérable est une porte d’entrée potentielle pour les attaquants. Adopter une démarche de veille proactive et maintenir un registre clair des dépendances est indispensable à la sécurisation de votre application.\r\n\r\n## Identification et authentification défaillantes\r\n\r\nCette catégorie recouvre les failles liées à une mauvaise gestion de l'identité des utilisateurs et des mécanismes d’authentification. Elle inclut, entre autres, les mots de passe faibles, l’absence de protection contre les attaques par force brute, ou encore des mécanismes d’authentification non sécurisés.\r\n\r\nUne authentification défaillante peut permettre à un attaquant d’usurper l’identité d’un utilisateur légitime, y compris un administrateur.\r\n**Django intègre plusieurs protections robustes :**\r\n- **Un système d’authentification **intégré, avec prise en charge des sessions, des mots de passe hachés (via `PBKDF2` par défaut), et des permissions par utilisateur ou groupe.\r\n- **Des outils** pour renforcer la sécurité, comme :\r\n\t- la prise en charge de politiques de mot de passe via des bibliothèques tierces (`django-password-validator`, `django-axes`, etc.),\r\n\t- le blocage temporaire ou définitif après plusieurs tentatives échouées de connexion,\r\n\t- l’authentification multi-facteur (2FA), facilement intégrable via des packages comme `django-otp` ou `django-two-factor-auth`.\r\n- **Des signaux** (`signals`) **Django** tels que `user_logged_in`, `user_login_failed` ou `user_logged_out`, permettant de déclencher des alertes ou des actions spécifiques en cas d'événements liés à la connexion.\r\n\r\nUn système d’authentification mal conçu est souvent le maillon faible de la chaîne de sécurité. Une politique rigoureuse, alliée à un audit régulier de vos points d’accès, est essentielle.\r\n\r\n\r\n## Échecs en matière d’intégrité logicielle\r\n\r\nCette catégorie regroupe les vulnérabilités liées à l’absence de vérification de l’intégrité du code ou des dépendances utilisées dans une application. Elle inclut notamment l’usage de bibliothèques compromises, la modification non contrôlée du code en production, ou encore l’absence de signature lors des mises à jour logicielles.\r\n\r\nUn attaquant peut ainsi injecter du code malveillant via une dépendance tierce, une mise à jour falsifiée, ou une chaîne CI/CD non sécurisée.\r\n\r\n**Django, bien que robuste, nécessite des bonnes pratiques complémentaires :**\r\n- **Gestion des dépendances** avec `pip freeze` ou `pip-tools`, pour figer les versions utilisées et éviter les changements non désirés.\r\n- **Utilisation d’un fichier** `requirements.txt` versionné dans un dépôt contrôlé, avec des vérifications d’intégrité (ex. : `hashin`, `pip-audit`).\r\n- **Surveillance continue des paquets** grâce à des outils comme `Safety`, `Dependabot` (GitHub) ou `Bandit` pour l’analyse statique du code Python.\r\n- **Signature et contrôle des déploiements** dans les environnements CI/CD (GitLab CI, GitHub Actions, Jenkins…), afin de garantir que seuls les binaires ou les scripts validés sont déployés.\r\n\r\nLa compromission d’une seule bibliothèque ou étape de déploiement peut suffire à compromettre tout votre système. Privilégiez la transparence, l’auditabilité, et l’automatisation sécurisée dans vos processus de livraison.\r\n\r\n## Défauts de journalisation et de surveillance\r\n\r\nCette vulnérabilité survient lorsque les applications n’enregistrent pas correctement les événements de sécurité, ou ne permettent pas une détection et une réponse rapides aux incidents. Sans journalisation adéquate, les attaques passent inaperçues, rendant toute investigation postérieure difficile, voire impossible.\r\n\r\nUne absence de surveillance ou une mauvaise configuration des alertes peut retarder la détection d’intrusions, d’escalades de privilèges, ou d’activités suspectes.\r\n**Avec Django, il est possible de mettre en œuvre une stratégie de journalisation efficace :**\r\n- **Le module `logging` de Python**, pleinement pris en charge par Django, permet de centraliser les logs applicatifs avec différents niveaux de criticité (`DEBUG`, `INFO`, `WARNING`, `ERROR`, `CRITICAL`).\r\n- **La configuration** dans `settings.py` permet de définir :\r\n\t- des formats d’affichage,\r\n\t- des handlers (fichiers, consoles, services externes),\r\n\t- et des règles de filtrage précises par module.\r\n-** L’utilisation de middlewares personnalisés** permet de tracer les requêtes entrantes, les erreurs HTTP, ou les événements utilisateur critiques (connexion, échec d’authentification, etc.).\r\n- **L’intégration avec des solutions de supervision** comme Sentry, ELK (Elasticsearch, Logstash, Kibana) ou Grafana Loki offre une visibilité en temps réel sur le comportement de l’application et facilite la corrélation d’événements.\r\n\r\nUne journalisation efficace ne doit pas compromettre la confidentialité des données : évitez de logguer des mots de passe, des tokens ou des informations sensibles.\r\n\r\n\r\n## Falsification des requêtes côté serveur (SSRF)\r\n\r\nLa falsification des requêtes côté serveur (Server-Side Request Forgery, SSRF) est une vulnérabilité qui permet à un attaquant de contraindre le serveur à effectuer des requêtes vers des adresses internes ou externes. Cela peut conduire à la divulgation d’informations sensibles, à la découverte de services internes, ou à l’exploitation de failles dans des services non exposés au public.\r\n\r\nUn exemple courant est l'accès non autorisé à des métadonnées de services cloud (comme AWS ou Google Cloud), via une requête mal filtrée.\r\n**Comment se protéger avec Django :**\r\n- **Validation stricte des entrées utilisateur** : ne jamais faire aveuglément confiance aux URL ou adresses fournies par l'utilisateur. Utilisez des expressions régulières ou des bibliothèques spécialisées pour valider et restreindre les domaines autorisés.\r\n- **Filtrage des hôtes **: Django permet de définir une liste blanche via le paramètre ALLOWED_HOSTS. Bien que ce paramètre protège principalement contre les attaques Host header, il doit être correctement configuré pour éviter certains détournements.\r\n- **Utilisation prudente de bibliothèques tierces **: si votre application interagit avec des ressources distantes (API, fichiers, etc.), privilégiez des bibliothèques réputées et vérifiez les redirections ou les réponses inattendues.\r\n- **Restrictions réseau** : limitez, au niveau de l’infrastructure, les capacités de votre serveur à effectuer des requêtes sortantes, notamment vers les IP internes ou les métadonnées cloud.\r\n\r\nEn cas de doute, isolez les composants sensibles dans des réseaux distincts et appliquez le principe du moindre privilège.\r\n\r\n## En matière de sécurité, l’anticipation vaut toujours mieux que la réaction.\r\n\r\nLa sécurité des applications web ne relève pas uniquement d’un ensemble de bonnes pratiques : elle constitue un enjeu majeur pour la pérennité, la réputation et la fiabilité d’un projet. Le Top 10 OWASP 2021 nous rappelle que les vulnérabilités les plus répandues restent souvent les plus négligées.\r\n\r\nDjango, par sa conception, offre une architecture robuste intégrant des mécanismes de sécurité dès la base : protection contre les injections, gestion fine des droits, hachage sécurisé des mots de passe, ou encore prévention des attaques CSRF.\r\n\r\nCependant, aucun framework ne saurait garantir à lui seul une sécurité parfaite. Il appartient aux développeurs de maîtriser les risques, de rester vigilants et de renforcer ces protections par une connaissance approfondie des menaces.\r\n\r\nAdopter une démarche proactive, auditer régulièrement son code et suivre les recommandations de l’OWASP sont autant de leviers pour construire des applications résilientes, dignes de confiance.\r\n",
      "created": "2025-05-29T13:05:21.427899",
      "updated": "2025-05-29T14:18:00.993418",
      "status_id": 1
    }
  ],
  "tag": [
    {
      "id": 1,
      "name": "html",
      "slug": "html"
    },
    {
      "id": 2,
      "name": "accessibilité",
      "slug": "accessibilite"
    },
    {
      "id": 3,
      "name": "seo",
      "slug": "seo"
    },
    {
      "id": 4,
      "name": "ux",
      "slug": "ux"
    },
    {
      "id": 5,
      "name": "django",
      "slug": "django"
    },
    {
      "id": 6,
      "name": "python",
      "slug": "python"
    },
    {
      "id": 7,
      "name": "OWASP2021",
      "slug": "owasp2021"
    },
    {
      "id": 8,
      "name": "cybersécurité",
      "slug": "cybersecurite"
    }
  ],
  "posttag": [
    {
      "id": 1,
      "posts_id": 1,
      "tags_id": 1
    },
    {
      "id": 2,
      "posts_id": 1,
      "tags_id": 2
    },
    {
      "id": 3,
      "posts_id": 1,
      "tags_id": 3
    },
    {
      "id": 4,
      "posts_id": 1,
      "tags_id": 4
    },
    {
      "id": 45,
      "posts_id": 2,
      "tags_id": 5
    },
    {
      "id": 46,
      "posts_id": 2,
      "tags_id": 6
    },
    {
      "id": 47,
      "posts_id": 2,
      "tags_id": 7
    },
    {
      "id": 48,
      "posts_id": 2,
      "tags_id": 8
    }
  ],
  "status": [
    {
      "id": 1,
      "name": "brouillon"
    },
    {
      "id": 2,
      "name": "offline"
    },
    {
      "id": 3,
      "name": "online"
    }
  ]
}